Конфигурация/Documents/СтрокаБанковскойВыписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СтрокаБанковскойВыписки</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлатежногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акцептовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АкцептованоОрганизация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РеестрПлатежейФизЛиц</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДанныеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
					<Comment>Универсальный передаточный документ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.Сделка</xr:Item>
				<xr:Item>Document.СделкаРЕПО</xr:Item>
				<xr:Item>Document.ПогашениеЦеннойБумаги</xr:Item>
				<xr:Item>Document.НачислениеДивидендов</xr:Item>
				<xr:Item>Document.ПогашениеКупона</xr:Item>
				<xr:Item>Document.НачислениеЗадолженности</xr:Item>
				<xr:Item>Document.СделкаСВалютой</xr:Item>
				<xr:Item>Document.ВводЦенныхБумаг</xr:Item>
				<xr:Item>Document.ЗакрытиеКредитногоИнструмента</xr:Item>
				<xr:Item>Document.Маржа</xr:Item>
				<xr:Item>Document.ОтменаСделки</xr:Item>
				<xr:Item>Document.РешениеОбИзмененииУставногоКапиталаООО</xr:Item>
				<xr:Item>Document.ПриходПроцентовПоКредитномуИнструменту</xr:Item>
				<xr:Item>Document.РаспределениеДоходаПайщикам</xr:Item>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПИФ</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccumulationRegister.РезервыПредстоящихРасходов</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.НакопленныеДоходыИРасходыКСписаниюПриПродажеЕПС</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумагКупленныеПоРЕПО</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.ПлановыеДатыОплат</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбеспечительныйПлатеж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлановогоПогашенияЗадолженности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КурсОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>25</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СобственныйКурсОплаты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплатыКупона</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СтрокаБанковскойВыписки/Forms/ОплатаКомиссии/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция СформироватьИтоговуюСтроку(Знач ДанныеКомиссии)
	
	ИтоговаяСтрока = "";
	
	ПоказателиИтоговойСтроки = Новый ТаблицаЗначений;
	ПоказателиИтоговойСтроки.Колонки.Добавить("Флажок");
	ПоказателиИтоговойСтроки.Колонки.Добавить("Статус");
	ПоказателиИтоговойСтроки.Колонки.Добавить("Валюта");
	ПоказателиИтоговойСтроки.Колонки.Добавить("Сумма");
	
	Для каждого СтрокаДанныеКомиссии Из ДанныеКомиссии Цикл
		НоваяСтрокаПоказателиИтоговойСтроки = ПоказателиИтоговойСтроки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаПоказателиИтоговойСтроки, СтрокаДанныеКомиссии);
		
		Если      НоваяСтрокаПоказателиИтоговойСтроки.Флажок = 1 Тогда // выбрано
			НоваяСтрокаПоказателиИтоговойСтроки.Статус = 1;
		ИначеЕсли НоваяСтрокаПоказателиИтоговойСтроки.Статус = 1 Тогда // не выбрано
			НоваяСтрокаПоказателиИтоговойСтроки.Статус = 2;
		ИначеЕсли НоваяСтрокаПоказателиИтоговойСтроки.Статус = 2 Тогда // обработано ранее
			НоваяСтрокаПоказателиИтоговойСтроки.Статус = 3;
		ИначеЕсли НоваяСтрокаПоказателиИтоговойСтроки.Статус = 0 Тогда // ошибки
			НоваяСтрокаПоказателиИтоговойСтроки.Статус = 4;
		КонецЕсли;
	КонецЦикла;
	
	ПоказателиИтоговойСтроки.Свернуть("Статус, Валюта", "Сумма");
	ПоказателиИтоговойСтроки.Сортировать("Статус, Валюта");
	
	ЗафиксированныеСтатусы = Новый Массив();
	
	Для каждого СтрокаПоказателиИтоговойСтроки Из ПоказателиИтоговойСтроки Цикл
		Если ЗафиксированныеСтатусы.Найти(СтрокаПоказателиИтоговойСтроки.Статус) = Неопределено Тогда
			ИтоговаяСтрока = ИтоговаяСтрока + ?(ПустаяСтрока(ИтоговаяСтрока), "", "; ");
			
			Если      СтрокаПоказателиИтоговойСтроки.Статус = 1 Тогда
				ИтоговаяСтрока = ИтоговаяСтрока + "Выбрано "
			ИначеЕсли СтрокаПоказателиИтоговойСтроки.Статус = 2 Тогда
				ИтоговаяСтрока = ИтоговаяСтрока + "Не выбрано "
			ИначеЕсли СтрокаПоказателиИтоговойСтроки.Статус = 3 Тогда
				ИтоговаяСтрока = ИтоговаяСтрока + "Обработано ранее "
			ИначеЕсли СтрокаПоказателиИтоговойСтроки.Статус = 4 Тогда
				ИтоговаяСтрока = ИтоговаяСтрока + "Ошибки "
			КонецЕсли;
			
			ЗафиксированныеСтатусы.Добавить(СтрокаПоказателиИтоговойСтроки.Статус);
		КонецЕсли;
		
		ИтоговаяСтрока = ИтоговаяСтрока + СтрокаПоказателиИтоговойСтроки.Сумма + " " + СтрокаПоказателиИтоговойСтроки.Валюта;
	КонецЦикла;
	
	Возврат ИтоговаяСтрока;
	
КонецФункции // СформироватьИтоговуюСтроку

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоговыеСуммы(Форма)
	
	Форма.Элементы.ДекорацияИтого.Заголовок = СформироватьИтоговуюСтроку(Форма.Комиссия);
	
КонецПроцедуры // ДанныеКомиссии


&НаСервере
Процедура ОбновитьКомиссиюНаСервере()
	
	ЭтаФорма.Комиссия.Очистить();
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ВидКомиссии) Или Не ЗначениеЗаполнено(ЭтаФорма.Период)
		Или Не ЗначениеЗаполнено(ЭтаФорма.Контрагент) Или Не ЗначениеЗаполнено(ЭтаФорма.РасчетныйСчетКонтрагента)
		Или Не ЗначениеЗаполнено(ЭтаФорма.Организация)
	Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженностиОснования.Ссылка КАК Ссылка,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.РасчетныйСчет КАК РасчетныйСчет,
		|	СУММА(НачислениеЗадолженностиОснования.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _НачислениеЗадолженности
		|ИЗ
		|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|ГДЕ
		|	НачислениеЗадолженностиОснования.Ссылка.Проведен
		|	И НачислениеЗадолженностиОснования.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И НачислениеЗадолженностиОснования.Ссылка.Организация = &Организация
		|	И НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности = &ВидЗадолженности
		|	И НачислениеЗадолженностиОснования.Ссылка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|
		|СГРУППИРОВАТЬ ПО
		|	НачислениеЗадолженностиОснования.Ссылка,
		|	НачислениеЗадолженностиОснования.Ссылка.СчетДоверительногоУправления,
		|	НачислениеЗадолженностиОснования.Ссылка.РасчетныйСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОплатаОснования.Ссылка КАК Ссылка,
		|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОплатаОснования.Ссылка.РасчетныйСчет КАК РасчетныйСчет,
		|	ОплатаОснования.Ссылка.СтрокаБанковскойВыписки КАК СтрокаБВ,
		|	ОплатаОснования.Основание КАК Основание,
		|	СУММА(ОплатаОснования.Сумма) КАК Сумма
		|ПОМЕСТИТЬ _Оплата
		|ИЗ
		|	Документ.Оплата.Основания КАК ОплатаОснования
		|ГДЕ
		|	ОплатаОснования.Ссылка.Проведен
		|	И ОплатаОснования.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И ОплатаОснования.Ссылка.Организация = &Организация
		|	И ОплатаОснования.Ссылка.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	И ОплатаОснования.Ссылка.ВидЗадолженности = &ВидЗадолженности
		|	И ОплатаОснования.Ссылка.МестоХранения = ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И ОплатаОснования.Ссылка.Контрагент = &Контрагент
		|	И ОплатаОснования.Ссылка.РасчетныйСчетКонтрагента = &РасчетныйСчетКонтрагента
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатаОснования.Ссылка,
		|	ОплатаОснования.Основание,
		|	ОплатаОснования.Ссылка.СчетДоверительногоУправления,
		|	ОплатаОснования.Ссылка.РасчетныйСчет,
		|	ОплатаОснования.Ссылка.СтрокаБанковскойВыписки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтрокаБанковскойВыписки.Ссылка КАК СтрокаБанковскойВыписки,
		|	СтрокаБанковскойВыписки.РасчетныйСчет КАК РасчетныйСчет,
		|	СтрокаБанковскойВыписки.РасчетныйСчет.Валюта КАК Валюта,
		|	СтрокаБанковскойВыписки.Сумма КАК Сумма,
		|	СтрокаБанковскойВыписки.НазначениеПлатежа КАК НазначениеПлатежа,
		|	ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_НачислениеЗадолженности.Ссылка КАК НачислениеЗадолженности,
		|	_Оплата.Ссылка КАК Оплата,
		|	ВЫБОР
		|		КОГДА НЕ ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления ЕСТЬ NULL
		|				И _Оплата.Ссылка ЕСТЬ NULL
		|			ТОГДА 1
		|		КОГДА НЕ ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления ЕСТЬ NULL
		|				И НЕ _НачислениеЗадолженности.Ссылка ЕСТЬ NULL
		|				И НЕ _Оплата.Ссылка ЕСТЬ NULL
		|			ТОГДА 2
		|		КОГДА _Оплата.Основание <> _НачислениеЗадолженности.Ссылка
		|			ТОГДА 0
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Статус,
		|	ВЫБОР
		|		КОГДА _Оплата.СтрокаБВ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ _Оплата.СтрокаБВ <> ЗНАЧЕНИЕ(Документ.СтрокаБанковскойВыписки.ПустаяСсылка)
		|	КОНЕЦ КАК ЗаполненаСтрокаБанковскойВыпискиВОплате
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	Документ.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоДенежнымСредствамСобственные КАК ИсполнителиПоДенежнымСредствамСобственные
		|		ПО СтрокаБанковскойВыписки.Организация = ИсполнителиПоДенежнымСредствамСобственные.Организация
		|			И СтрокаБанковскойВыписки.РасчетныйСчет = ИсполнителиПоДенежнымСредствамСобственные.РасчетныйСчет
		|			И (ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия >= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|				ИЛИ ИсполнителиПоДенежнымСредствамСобственные.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.ДатаЗаключения <= &Дата)
		|			И (ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления.ДатаРасторжения >= &Дата)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Оплата КАК _Оплата
		|		ПО (ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = _Оплата.СчетДоверительногоУправления)
		|			И СтрокаБанковскойВыписки.Ссылка = _Оплата.СтрокаБВ
		|			И СтрокаБанковскойВыписки.РасчетныйСчет = _Оплата.РасчетныйСчет
		|			И СтрокаБанковскойВыписки.Сумма = _Оплата.Сумма
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НачислениеЗадолженности КАК _НачислениеЗадолженности
		|		ПО (ИсполнителиПоДенежнымСредствамСобственные.СчетДоверительногоУправления = _НачислениеЗадолженности.СчетДоверительногоУправления)
		|			И СтрокаБанковскойВыписки.РасчетныйСчет = _НачислениеЗадолженности.РасчетныйСчет
		|			И СтрокаБанковскойВыписки.Сумма = _НачислениеЗадолженности.Сумма
		|			И (_Оплата.Основание = _НачислениеЗадолженности.Ссылка)
		|ГДЕ
		|	НЕ СтрокаБанковскойВыписки.ПометкаУдаления
		|	И СтрокаБанковскойВыписки.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
		|	И СтрокаБанковскойВыписки.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	И СтрокаБанковскойВыписки.Организация = &Организация
		|	И СтрокаБанковскойВыписки.Контрагент = &Контрагент
		|	И СтрокаБанковскойВыписки.РасчетныйСчетКонтрагента = &РасчетныйСчетКонтрагента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ _ИмеющиеНесколькоВариантовРазнесения
		|ИЗ
		|	_Данные КАК _Данные
		|ГДЕ
		|	НЕ _Данные.ЗаполненаСтрокаБанковскойВыпискиВОплате
		|	И НЕ _Данные.СтрокаБанковскойВыписки В
		|				(ВЫБРАТЬ
		|					_Данные.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки
		|				ИЗ
		|					_Данные КАК _Данные
		|				ГДЕ
		|					_Данные.ЗаполненаСтрокаБанковскойВыпискиВОплате)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Данные.СтрокаБанковскойВыписки
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.СтрокаБанковскойВыписки КАК СтрокаБанковскойВыписки,
		|	_Данные.РасчетныйСчет КАК РасчетныйСчет,
		|	_Данные.Валюта КАК Валюта,
		|	_Данные.Сумма КАК Сумма,
		|	_Данные.НазначениеПлатежа КАК НазначениеПлатежа,
		|	_Данные.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Данные.НачислениеЗадолженности КАК НачислениеЗадолженности,
		|	_Данные.Оплата КАК Оплата,
		|	_Данные.Статус КАК Статус,
		|	ЕСТЬNULL(_КоличествоИсполнителей.Количество, 1) КАК Количество
		|ИЗ
		|	_Данные КАК _Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ИмеющиеНесколькоВариантовРазнесения КАК _КоличествоИсполнителей
		|		ПО _Данные.СтрокаБанковскойВыписки = _КоличествоИсполнителей.СтрокаБанковскойВыписки";
		
	Запрос.УстановитьПараметр("Дата",                     ЭтаФорма.Период);
	Запрос.УстановитьПараметр("Организация",              ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Контрагент",               ЭтаФорма.Контрагент);
	Запрос.УстановитьПараметр("РасчетныйСчетКонтрагента", ЭтаФорма.РасчетныйСчетКонтрагента);
	Запрос.УстановитьПараметр("ВидЗадолженности",         ЭтаФорма.ВидКомиссии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаКомиссия = ЭтаФорма.Комиссия.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаКомиссия, Выборка);
		
		НоваяСтрокаКомиссия.Флажок = (Выборка.Количество < 2 И НоваяСтрокаКомиссия.Статус = 1);
	КонецЦикла;
	
	ИмеющиеНесколькоВариантовРазнесения = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_ИмеющиеНесколькоВариантовРазнесения");
	
	Выборка = ИмеющиеНесколькоВариантовРазнесения.ПолучитьДанные().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По '" + Выборка.СтрокаБанковскойВыписки + "' обнаружено несколько вариантов для разнесения!");
	КонецЦикла;
	
	ОбновитьИтоговыеСуммы(ЭтаФорма);
	
КонецПроцедуры // ОбновитьКомиссиюНаСервере

&НаСервереБезКонтекста
Функция ПолучитьПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее()

	
	ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее = Новый ТаблицаЗначений;
	
	ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Колонки.Добавить("Банк", Новый ОписаниеТипов("СправочникСсылка.ЮрФизЛица"));
	ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Колонки.Добавить("ГФУ", Новый ОписаниеТипов("СправочникСсылка.ГруппыФинансовогоУчетаДоходовРасходов"));
	ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Колонки.Добавить("Ключ", Новый ОписаниеТипов("Строка"));

	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53102");
	СтрокаПравила.Ключ = "Комиссия за ведение банк. счета в валюте РФ";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за услугу по п. 3.2.1.3 Тарифов банка за перевод";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за услугу Тарифов банка п. 3.2.1.4 за перевод";

	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за услуга  п. 3.2.1.5 Тарифов банка";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Ежемесячная плата за обслуживание с использованием системы ""Клиент-Банк""";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за предоставление программного обеспечения АРМ ""Клиента""системы ""Клиент-Банк. WEB"" без выезда специалиста (Тарифы п.8.1.1)";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_БанкГПБ");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53106");
	СтрокаПравила.Ключ = "Комиссия за выдачу сводной справки по одному/нескольким счетам - на бумажном носителе в соответствии с п. 4.3.3.1.1. Тарифов Банка";
	
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53101");
	СтрокаПравила.Ключ = "Комиссия за открытие банковского расчетного счета";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53102");
	СтрокаПравила.Ключ = "Ежемесячная комиссия за обслуживание счета, подключенного к системе ""ДБО""";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за исполнение (в т.ч. частичное) межбанковских платежей, поступивших по электронным каналам связи по счету ";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за исполнение (в т.ч. частичное) внутрибанковских платежей, поступивших по электронным каналам связи по счету";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Ежемесячная комиссия за предоставление услуги ""Акцепт""";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за срочный перевод в рублях по счету";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Ежемесячная комиссия за обслуживание сервиса ""ИБК"" услуги ""ДБО"", включая сопровождение СКЗИ";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за оказание услуг, связанных с переводом денежных средств (есть в БУДУЩЕМ ""Эквайринг"")";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53103");
	СтрокаПравила.Ключ = "Комиссия за оплату ИП, поступивших по электронным каналам, на счета получателей в др. Банках";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53106");
	СтрокаПравила.Ключ = "Комиссия за предоставление Клиенту информации для аудиторских компаний по счету";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53106");
	СтрокаПравила.Ключ = "Комис. за выдачу справки об остатках и движении д.с.";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53106");
	СтрокаПравила.Ключ = "Комиссия за изменение условий/отзыв расчетных документов в валюте РФ";
	
	СтрокаПравила = ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее.Добавить();
	СтрокаПравила.Банк = ОбщегоНазначения.ПолучитьИменованныйОбъект("ЮрФизЛицо_ФилиалВТБВМоскве");
	СтрокаПравила.ГФУ = Справочники.ГруппыФинансовогоУчетаДоходовРасходов.НайтиПоКоду("53106");
	СтрокаПравила.Ключ = "Комиссия за проведение процедур ВК по вал.операции между рез. и нерез., в т.ч. по контракту с УНК";
	
	Возврат ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее;

КонецФункции

&НаСервере
Процедура СоздатьКомиссиюНаСервере()
	
	ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее = ПолучитьПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее(); 
	
	ТекДата = ТекущаяДатаСеанса();
	ДатаДокументовНачисления	= ?(ТекДата > ЭтаФорма.Период + 14*60*60, ЭтаФорма.Период + 14*60*60, ТекДата);
	ДатаДокументовОплаты		= ?(ТекДата > ЭтаФорма.Период + 14*60*60 + 30*60, ЭтаФорма.Период + 14*60*60 + 30*60, ТекДата + 1);
	
	Для каждого СтрокаКомиссия Из ЭтаФорма.Комиссия Цикл
		Если Не СтрокаКомиссия.Флажок Тогда
			Продолжить;
		КонецЕсли;
		
		ШаблонСообщенияОбОшибке = "Не удалось создать %1 по счету д/у " + СтрокаКомиссия.СчетДоверительногоУправления
									+ ", р/счету " + СтрокаКомиссия.РасчетныйСчет + " на сумму " + СтрокаКомиссия.Сумма;
		
		НачатьТранзакцию();
		
		// поступление услуг
		НачислениеЗадолженности = СтрокаКомиссия.НачислениеЗадолженности;
				 
		Если Не ЗначениеЗаполнено(НачислениеЗадолженности) Тогда
			НачислениеЗадолженности = Документы.НачислениеЗадолженности.СоздатьДокумент();
			
			НачислениеЗадолженности.Дата									= ДатаДокументовНачисления;
			НачислениеЗадолженности.Организация								= ЭтаФорма.Организация;
			НачислениеЗадолженности.ВидЗадолженности						= ЭтаФорма.ВидКомиссии;
			НачислениеЗадолженности.СчетДоверительногоУправления			= СтрокаКомиссия.СчетДоверительногоУправления;
			НачислениеЗадолженности.МестоХранения							= Справочники.МестаХранения.ВнебиржевойРынок;
			НачислениеЗадолженности.РасчетныйСчет							= СтрокаКомиссия.РасчетныйСчет;
			НачислениеЗадолженности.Валюта									= СтрокаКомиссия.Валюта;
			НачислениеЗадолженности.Контрагент								= ЭтаФорма.Контрагент;
			НачислениеЗадолженности.Ответственный							= РаботаСПользователями.ТекущийПользователь();
			НачислениеЗадолженности.ПрочиеДоходыИРасходы					= ПолучитьПрочиеДоходыИРасходы(ЭтаФорма.ВидКомиссии);
			
			НачислениеЗадолженности.ГруппаФинансовогоУчетаДоходовРасходов	= ПолучитьГруппуФинансовогоУчетаДоходовРасходов(
																					ЭтаФорма.Период,
																					ЭтаФорма.Организация,
																					СтрокаКомиссия.СчетДоверительногоУправления,
																					НачислениеЗадолженности.ВидЗадолженности,
																					НачислениеЗадолженности.ПрочиеДоходыИРасходы,
																					СтрокаКомиссия.СтрокаБанковскойВыписки,
																					ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее);
																					
			НачислениеЗадолженности.ДатаПолученияДокумента					= НачислениеЗадолженности.Дата;
			
			Если ЗначениеЗаполнено(СтрокаКомиссия.НомерСФ) И ЗначениеЗаполнено(СтрокаКомиссия.ДатаСФ) Тогда
				НачислениеЗадолженности.ВидВходящегоДокумента   = Перечисления.ВидыВходящихДокументов.СчетФактура;
				НачислениеЗадолженности.НомерВходящегоДокумента = СтрокаКомиссия.НомерСФ;
				НачислениеЗадолженности.ДатаВходящегоДокумента  = СтрокаКомиссия.ДатаСФ;
			КонецЕсли;
			
			НоваяСтрокаОснования = НачислениеЗадолженности.Основания.Добавить();
			НоваяСтрокаОснования.Сумма = СтрокаКомиссия.Сумма;
			
			Если Не НачислениеЗадолженности.ПроверитьЗаполнение() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОбОшибке, "начисление задолженности"));
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			Попытка
				НачислениеЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОбОшибке, "начисление задолженности"));
				ОтменитьТранзакцию();
				Продолжить;
			КонецПопытки;
			
			НачислениеЗадолженности = НачислениеЗадолженности.Ссылка;
		КонецЕсли;
		
		// оплата
		Оплата = Документы.Оплата.СоздатьДокумент();
		
		Оплата.Дата                         = ДатаДокументовОплаты;
		Оплата.Организация                  = ЭтаФорма.Организация;
		Оплата.ВидЗадолженности             = ЭтаФорма.ВидКомиссии;
		Оплата.ВидДвижения                  = Перечисления.ВидыДвижений.Расход;
		Оплата.СчетДоверительногоУправления = СтрокаКомиссия.СчетДоверительногоУправления;
		Оплата.МестоХранения                = Справочники.МестаХранения.ВнебиржевойРынок;
		Оплата.РасчетныйСчет                = СтрокаКомиссия.РасчетныйСчет;
		Оплата.СтрокаБанковскойВыписки      = СтрокаКомиссия.СтрокаБанковскойВыписки;
		Оплата.ВалютаОплаты                 = СтрокаКомиссия.Валюта;
		Оплата.Ответственный                = РаботаСПользователями.ТекущийПользователь();
		Оплата.Контрагент   	            = ЭтаФорма.Контрагент;
		Оплата.РасчетныйСчетКонтрагента 	= ЭтаФорма.РасчетныйСчетКонтрагента;
		
		НоваяСтрокаОснования = Оплата.Основания.Добавить();
		НоваяСтрокаОснования.Основание                = НачислениеЗадолженности;
		НоваяСтрокаОснования.Сумма                    = СтрокаКомиссия.Сумма;
		НоваяСтрокаОснования.Валюта                   = СтрокаКомиссия.Валюта;
		
		Если Не Оплата.ПроверитьЗаполнение() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОбОшибке, "оплату"));
			ОтменитьТранзакцию();
			Продолжить;
		КонецЕсли;
		
		Попытка
			Оплата.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонСообщенияОбОшибке, "оплату"));
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;		
		
		ЗафиксироватьТранзакцию();
		
	КонецЦикла;
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры // СоздатьКомиссиюНаСервере

&НаСервереБезКонтекста
Функция ПолучитьПрочиеДоходыИРасходы(ВидЗадолженности)
	
	Если ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии") Тогда
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам брокера");
	ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоДепозитарнойКомиссии")
		ИЛИ ПринадлежитГруппеЗадолженностей(ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ДепозитарнаяКомиссия")) Тогда 	
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам депозитария");
	ИначеЕсли ВидЗадолженности = ПредопределенноеЗначение("Справочник.ВидыЗадолженности.ПоБанковскойКомиссии")
		ИЛИ ПринадлежитГруппеЗадолженностей(ВидЗадолженности, ПредопределенноеЗначение("Справочник.ВидыЗадолженности.БанковскаяКомиссия")) Тогда 	
		Возврат Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Комиссия банка");	
	КонецЕсли;
	
КонецФункции // ПолучитьДепозитарийКонтрагента

&НаСервереБезКонтекста
Функция ПринадлежитГруппеЗадолженностей(ВидЗадолженности, Группа)
	Если НЕ ЗначениеЗаполнено(ВидЗадолженности) Тогда
		Возврат Ложь;
	Иначе
		Возврат ВидЗадолженности.ПринадлежитЭлементу(Группа);
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГруппуФинансовогоУчетаДоходовРасходов(Дата, Организация, СчетДоверительногоУправления, ВидЗадолженности, ПрочиеДоходыИРасходы, СтрокаБанковскойВыписки, ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее)

	Если БухгалтерскийУчетЕПС.ЭтоКлиентГруппыБудущее(СчетДоверительногоУправления, Дата) Тогда // попробуем определить по ключевым словам в назначении платежа
		
		Для каждого ПравилоОпределенияГФУдляКомиссийБанкаГруппыБудущее Из ПравилаОпределенияГФУдляКомиссийБанкаГруппыБудущее Цикл
			
			Если СтрокаБанковскойВыписки.ВидДвижения = Перечисления.ВидыДвижений.Расход
				И СтрокаБанковскойВыписки.Контрагент = ПравилоОпределенияГФУдляКомиссийБанкаГруппыБудущее.Банк
				И СтрНайти(СтрокаБанковскойВыписки.НазначениеПлатежа, ПравилоОпределенияГФУдляКомиссийБанкаГруппыБудущее.Ключ) <> 0 Тогда
			
				Возврат ПравилоОпределенияГФУдляКомиссийБанкаГруппыБудущее.ГФУ;
			
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидЗадолженности) Тогда
		
		Возврат БухгалтерскийУчет.ОпределитьГруппуФинансовогоУчетаПоПрочимДоходамРасходам(
									Дата,
									Организация,
									СчетДоверительногоУправления,
									ВидЗадолженности,
									ПрочиеДоходыИРасходы);
		
	КонецЕсли; 

КонецФункции // ПолучитьГруппуФинансовогоУчетаДоходовРасходов()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры, "Период, Организация, Контрагент, РасчетныйСчетКонтрагента");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыЗадолженности.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗадолженности КАК ВидыЗадолженности
		|ГДЕ
		|	ВидыЗадолженности.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.Комиссия))";
	
	Элементы.ВидКомиссии.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	ЭтаФорма.ВидКомиссии = Справочники.ВидыЗадолженности.КомиссияБанкаЗаПереводДС;
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКомиссииПриИзменении(Элемент)
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетКонтрагентаПриИзменении(Элемент)
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомиссияФлажокПриИзменении(Элемент)
	
	ОбновитьИтоговыеСуммы(ЭтаФорма);
	
КонецПроцедуры



&НаКлиенте
Процедура КомиссияПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Комиссия.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// редактировать разрешено только номер, дату с/ф и флажок для строк со статусом 1
	Если ТекущиеДанные.Статус = 1
		И (Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияНомерСФ
			Или Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияДатаСФ
			Или Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияФлажок)
	Тогда
		Возврат;
	КонецЕсли;
	
	// все прочие поля штатно не редактируются
	Отказ = Истина;
	
	Если Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияСтрокаБанковскойВыписки
		И ЗначениеЗаполнено(ТекущиеДанные.СтрокаБанковскойВыписки)
	Тогда
		ОткрытьЗначение(ТекущиеДанные.СтрокаБанковскойВыписки);
		
	ИначеЕсли Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияНачислениеЗадолженности
		И ЗначениеЗаполнено(ТекущиеДанные.НачислениеЗадолженности)
	Тогда
		ОткрытьЗначение(ТекущиеДанные.НачислениеЗадолженности);
		
	ИначеЕсли Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияОплата
		И ЗначениеЗаполнено(ТекущиеДанные.Оплата)
	Тогда
		ОткрытьЗначение(ТекущиеДанные.Оплата);
		
	ИначеЕсли Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияСчетДоверительногоУправления
		И ЗначениеЗаполнено(ТекущиеДанные.СчетДоверительногоУправления)
	Тогда
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
		
	ИначеЕсли Элементы.Комиссия.ТекущийЭлемент = Элементы.КомиссияРасчетныйСчет
		И ЗначениеЗаполнено(ТекущиеДанные.РасчетныйСчет)
	Тогда
		ОткрытьЗначение(ТекущиеДанные.РасчетныйСчет);
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаСоздатьДокументы(Команда)
	
	СоздатьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКомиссиюНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	Для каждого СтрокаКомиссия Из ЭтаФорма.Комиссия Цикл
		СтрокаКомиссия.Флажок = (СтрокаКомиссия.Статус = 1);
	КонецЦикла;
	
	ОбновитьИтоговыеСуммы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	Для каждого СтрокаКомиссия Из ЭтаФорма.Комиссия Цикл
		СтрокаКомиссия.Флажок = 0;
	КонецЦикла;
	
	ОбновитьИтоговыеСуммы(ЭтаФорма);
	
КонецПроцедуры
